KenRouKoro/micropython/ports/esp32/boards/FOXAPPLICATION_S324MR/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME               "FoxApplication S324MR"
#define MICROPY_HW_MCU_NAME                 "ESP32-S3-WROOM-1U-N16R8"
#define MICROPY_PY_NETWORK_HOSTNAME_DEFAULT "FoxApplication S324MR"

#define MICROPY_HW_I2C0_SCL                 (38)
#define MICROPY_HW_I2C0_SDA                 (39)

#define MICROPY_HW_USB_MANUFACTURER_STRING "FoxApplication"
#define MICROPY_HW_USB_PRODUCT_FS_STRING "FoxApplication S324MR"